In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('data/preprocessed_data.csv')

In [5]:
data.head()

   Unnamed: 0                                            reviews
0           0   flying a business class pleasure ba made disa...
1           1   british airways absolutely care reserved seat...
2           2   recent experience british airways horrendous ...
3           3   express displeasure concerns regarding flight...
4           4   flew london malaga  august club europe stood ...

In [7]:
data.isna().sum()

Unnamed: 0    0
reviews       0
dtype: int64

In [9]:
data = data[["reviews"]]

In [10]:
data.head()

                                             reviews
0   flying a business class pleasure ba made disa...
1   british airways absolutely care reserved seat...
2   recent experience british airways horrendous ...
3   express displeasure concerns regarding flight...
4   flew london malaga  august club europe stood ...

In [24]:
import nltk
from nltk.tokenize import word_tokenize

In [25]:
df = pd.DataFrame(data)

In [26]:
nltk.download('punkt')

[nltk_data] Downloading package punkt to /home/bhavin/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

True

In [27]:
df['Tokens'] = df['reviews'].apply(lambda x:word_tokenize(x))

In [28]:
df.head()

,reviews,Tokens
0,flying a business class pleasure ba made disa...,"[flying, a, business, class, pleasure, ba, mad..."
1,british airways absolutely care reserved seat...,"[british, airways, absolutely, care, reserved,..."
2,recent experience british airways horrendous ...,"[recent, experience, british, airways, horrend..."
3,express displeasure concerns regarding flight...,"[express, displeasure, concerns, regarding, fl..."
4,flew london malaga august club europe stood ...,"[flew, london, malaga, august, club, europe, s..."

In [30]:
df = df['Tokens']

In [31]:
df.head()

0    [flying, a, business, class, pleasure, ba, mad...
1    [british, airways, absolutely, care, reserved,...
2    [recent, experience, british, airways, horrend...
3    [express, displeasure, concerns, regarding, fl...
4    [flew, london, malaga, august, club, europe, s...
Name: Tokens, dtype: object

In [32]:
df.to_csv("data/toknized_data.csv")